Ran Plan for 2 projects:

1. dir: `Project_1` workspace: `default`
1. dir: `.` workspace: `default`

### 1. dir: `Project_1` workspace: `default`
<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vm_creation[0].google_compute_instance.vm1["gcloud-vm-using-atlantis-p1"] has been changed
~ resource "google_compute_instance" "vm1" {
        id                        = "projects/terraform-gcp-463406/zones/asia-southeast1-a/instances/gcloud-vm-using-atlantis-p1"
      + labels                    = {}
        name                      = "gcloud-vm-using-atlantis-p1"
      + resource_policies         = []
        tags                      = [
            "http-server",
            "https-server",
            "ssh",
        ]
        # (18 unchanged attributes hidden)

      ~ boot_disk {
            # (6 unchanged attributes hidden)

          ~ initialize_params {
              + resource_manager_tags       = {}
                # (9 unchanged attributes hidden)
            }
        }



        # (3 unchanged blocks hidden)
    }
  # module.vm_creation[0].google_compute_instance.vm1["gcloud-vm3-using-atlantis-p1"] has been changed
~ resource "google_compute_instance" "vm1" {
        id                        = "projects/terraform-gcp-463406/zones/asia-southeast1-a/instances/gcloud-vm3-using-atlantis-p1"
      + labels                    = {}
      ~ metadata                  = {
          ~ "ssh-keys" = <<-EOT
                centos:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDCJUnEXVij0etERGHebfRZ/hFgPkC89tSJvm/3O50SAbeMfcucyhKKDZiNlsVSM6N1dwzlM12EWq2ESW2ZyEdrLwbJclu6FCz6WGxRJXUSSIFoxpbJTp2xKbJxLlze9nsWUJ1IAY1UnHXH7oDY5aKimK7P+ixRZ0vOY24WgfmypU6nmWZNZ5kLQoVmK3xeJ+oLkMTSab6Si3XRDHBWAnLnlbKSxxMClDcmlE2AIU7TcUw0bMWm/F4mis0cICWuR/Z4rsW2iEAkv655mwK4NOsxiC0nUJnOaBjMA5FZwg+zA0xOGus1OR09OBtWGBruzcMRHyx0nCzmfwQKKo8fjEUpTDM+XCBi06cElhqlfIkaTcVo/hlWGktHnYheSgg8MaEsNrp2UrL7JE9rMaYrm87v4QhzRbwzTTuiQEPKLNm91S289QozKCB7CmvWbGdt0W5Jm+LvSc+J4XRGJMjNmcKOj0LANjrQ5IftzIa4sAAxm1BFhh6eT52GQKb7I80Ui2k= yashwanthm@Yashwanths-MacBook-Pro-2.local
              + yashwanthm194:ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBBXwmHDv+tMmzFjpg9p7SlVvCRqxOHQ69nCR0UINefFDvC0r7UV+VVF1KnLRa5E2mSxwrrTRIchWWc+Qvrc4pmU= google-ssh {"userName":"yashwanthm194@gmail.com","expireOn":"2025-07-03T11:01:35+0000"}
              + yashwanthm194:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAFJho2MX/C3RA+dZBaNNN2cVqswQIwkiYXMzJ5kUBqEuXMFpJ2p6iMHubdthwzgqX3M2z105iQJ02uQb/fMmDSlUbWct0WuDv+nj9sX4T5nrStcBClzC8I3w7+PzJVQmTZxjmMp3LbUA4F+rD3P6v5ErhqVn6nFOIHNe9WRGVZlvOoj6Q6TspC1AeXY4QKQC6/K6LTB/jbh3/UuvMMOQldgK8rbuLjXrsTzjwqdzKvhvcN+ECq7FLXBeeNLVnXAjVrNgGPdAhnIa926C+fHxrEb01HwmmcrarWzbRU+r7daCSZGQXWQxU9kdesH+2hJGDISt79s3g92+6VwxNLBYFDk= google-ssh {"userName":"yashwanthm194@gmail.com","expireOn":"2025-07-03T11:01:39+0000"}
            EOT
        }
      ~ metadata_fingerprint      = "j2mqd6A5r8w=" -> "cPlUv1lvOwU="
        name                      = "gcloud-vm3-using-atlantis-p1"
      + resource_policies         = []
        tags                      = [
            "http-server",
            "https-server",
            "ssh",
        ]
        # (16 unchanged attributes hidden)

      ~ boot_disk {
            # (6 unchanged attributes hidden)

          ~ initialize_params {
              + resource_manager_tags       = {}
                # (9 unchanged attributes hidden)
            }
        }



        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.vm_creation[0].google_compute_instance.vm1["gcloud-vm2-using-atlantis-p1"] will be created
+ resource "google_compute_instance" "vm1" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + creation_timestamp        = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + effective_labels          = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "e2-standard-4"
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDCJUnEXVij0etERGHebfRZ/hFgPkC89tSJvm/3O50SAbeMfcucyhKKDZiNlsVSM6N1dwzlM12EWq2ESW2ZyEdrLwbJclu6FCz6WGxRJXUSSIFoxpbJTp2xKbJxLlze9nsWUJ1IAY1UnHXH7oDY5aKimK7P+ixRZ0vOY24WgfmypU6nmWZNZ5kLQoVmK3xeJ+oLkMTSab6Si3XRDHBWAnLnlbKSxxMClDcmlE2AIU7TcUw0bMWm/F4mis0cICWuR/Z4rsW2iEAkv655mwK4NOsxiC0nUJnOaBjMA5FZwg+zA0xOGus1OR09OBtWGBruzcMRHyx0nCzmfwQKKo8fjEUpTDM+XCBi06cElhqlfIkaTcVo/hlWGktHnYheSgg8MaEsNrp2UrL7JE9rMaYrm87v4QhzRbwzTTuiQEPKLNm91S289QozKCB7CmvWbGdt0W5Jm+LvSc+J4XRGJMjNmcKOj0LANjrQ5IftzIa4sAAxm1BFhh6eT52GQKb7I80Ui2k= yashwanthm@Yashwanths-MacBook-Pro-2.local
            EOT
        }
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "gcloud-vm2-using-atlantis-p1"
      + project                   = "terraform-gcp-463406"
      + self_link                 = (known after apply)
      + tags                      = [
          + "http-server",
          + "https-server",
          + "ssh",
        ]
      + tags_fingerprint          = (known after apply)
      + terraform_labels          = {
          + "goog-terraform-provisioned" = "true"
        }
      + zone                      = "asia-southeast1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + guest_os_features          = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + architecture           = (known after apply)
              + image                  = "ubuntu-os-cloud/ubuntu-2204-lts"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + resource_policies      = (known after apply)
              + size                   = 20
              + snapshot               = (known after apply)
              + type                   = (known after apply)
            }
        }

      + confidential_instance_config {
          + confidential_instance_type  = (known after apply)
          + enable_confidential_compute = (known after apply)
        }

      + guest_accelerator {
          + count = (known after apply)
          + type  = (known after apply)
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_attachment          = (known after apply)
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + availability_domain         = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)
          + termination_time            = (known after apply)

          + local_ssd_recovery_timeout {
              + nanos   = (known after apply)
              + seconds = (known after apply)
            }

          + max_run_duration {
              + nanos   = (known after apply)
              + seconds = (known after apply)
            }

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }

          + on_instance_stop_action {
              + discard_local_ssd = (known after apply)
            }
        }
    }

  # module.vm_creation[0].google_compute_instance.vm1["gcloud-vm3-using-atlantis-p1"] will be updated in-place
~ resource "google_compute_instance" "vm1" {
        id                        = "projects/terraform-gcp-463406/zones/asia-southeast1-a/instances/gcloud-vm3-using-atlantis-p1"
      ~ metadata                  = {
          ~ "ssh-keys" = <<-EOT
                centos:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDCJUnEXVij0etERGHebfRZ/hFgPkC89tSJvm/3O50SAbeMfcucyhKKDZiNlsVSM6N1dwzlM12EWq2ESW2ZyEdrLwbJclu6FCz6WGxRJXUSSIFoxpbJTp2xKbJxLlze9nsWUJ1IAY1UnHXH7oDY5aKimK7P+ixRZ0vOY24WgfmypU6nmWZNZ5kLQoVmK3xeJ+oLkMTSab6Si3XRDHBWAnLnlbKSxxMClDcmlE2AIU7TcUw0bMWm/F4mis0cICWuR/Z4rsW2iEAkv655mwK4NOsxiC0nUJnOaBjMA5FZwg+zA0xOGus1OR09OBtWGBruzcMRHyx0nCzmfwQKKo8fjEUpTDM+XCBi06cElhqlfIkaTcVo/hlWGktHnYheSgg8MaEsNrp2UrL7JE9rMaYrm87v4QhzRbwzTTuiQEPKLNm91S289QozKCB7CmvWbGdt0W5Jm+LvSc+J4XRGJMjNmcKOj0LANjrQ5IftzIa4sAAxm1BFhh6eT52GQKb7I80Ui2k= yashwanthm@Yashwanths-MacBook-Pro-2.local
              - yashwanthm194:ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBBXwmHDv+tMmzFjpg9p7SlVvCRqxOHQ69nCR0UINefFDvC0r7UV+VVF1KnLRa5E2mSxwrrTRIchWWc+Qvrc4pmU= google-ssh {"userName":"yashwanthm194@gmail.com","expireOn":"2025-07-03T11:01:35+0000"}
              - yashwanthm194:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAFJho2MX/C3RA+dZBaNNN2cVqswQIwkiYXMzJ5kUBqEuXMFpJ2p6iMHubdthwzgqX3M2z105iQJ02uQb/fMmDSlUbWct0WuDv+nj9sX4T5nrStcBClzC8I3w7+PzJVQmTZxjmMp3LbUA4F+rD3P6v5ErhqVn6nFOIHNe9WRGVZlvOoj6Q6TspC1AeXY4QKQC6/K6LTB/jbh3/UuvMMOQldgK8rbuLjXrsTzjwqdzKvhvcN+ECq7FLXBeeNLVnXAjVrNgGPdAhnIa926C+fHxrEb01HwmmcrarWzbRU+r7daCSZGQXWQxU9kdesH+2hJGDISt79s3g92+6VwxNLBYFDk= google-ssh {"userName":"yashwanthm194@gmail.com","expireOn":"2025-07-03T11:01:39+0000"}
            EOT
        }
        name                      = "gcloud-vm3-using-atlantis-p1"
        tags                      = [
            "http-server",
            "https-server",
            "ssh",
        ]
        # (19 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d Project_1`
* :put_litter_in_its_place: To **delete** this plan click [here](http://d03477dc3ffd:4141/lock?id=yashwanthm998%252Fatlantis%252FProject_1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d Project_1`
</details>
Plan: 1 to add, 1 to change, 0 to destroy.

---
### 2. dir: `.` workspace: `default`
```diff

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://d03477dc3ffd:4141/lock?id=yashwanthm998%252Fatlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
